    设计一个股票盯盘的前端软件，功能如下：
1. 可以添加a股、港股、美股的股票、指数等等，添加的数据放在浏览器，提供删除功能
2. 列表展示股票代号、分类（a股、港股等等）、当前值（或者上一个交易日收盘价）、交易状态、近五个交易日、20个交易日、120日交易日涨跌
如果是股票 展示其总市值
3. 可以点击具体的股票或者基金，展示详细数据
包括k线图、均线图、市值、市盈率、市净率等常见数据
4. 添加一个搜索模块， 可以根据股票或者公司名字 搜索股票，然后显示简要信息，搜索后的股票可以快捷添加到收藏


要求：
    1， 页面简洁、美观、现代化
    2. 使用vue来实现
    3. 使用合适的api来获取这些数据，尽量并发获取，相应速度要快
    4. 提供自动刷新功能，可以设置自动刷新频率
    5. 取一个现代化、富有含义的名字



lsof -t -i:3000 | xargs kill -9 2>/dev/null; cd ~/Desktop/front-stock && npm run dev -- --port 3000

1. 解析数据 https://stockpage.10jqka.com.cn/HK9988/company/  获取公司基本面数据
2. 解析经营数据  https://stockpage.10jqka.com.cn/HK9988/finance/  